performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
    - duration: 2
      arrivalRate: 1
      name: "Phase 2"
    - duration: 3
      arrivalRate: 1
      name: "Phase 3"
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.TOKEN }}"
      Content-Type: application/json
  processor: "./scripts/scripts.js"
scenarios:
  - flow:
    - function: generateTestData
    - get:
        url: "/rest/v1/tasks"
        qs: 
          project_id: "{{ $processEnvironment.ID_PROJECT }}"
    - post:
        url: "/rest/v1/tasks"
        json: 
          content: "{{ content }}"
          priority: "{{ priority }}"
          project_id: 2261254215
        capture: 
          json: "$.id"
          as: "idTask"
    - get:
        url: "/rest/v1/tasks/{{ idTask }}"
    - post:
        url: "/rest/v1/tasks/{{ idTask }}"
        json: 
          content: "{{ updateContent }}"
          priority: "{{ updatePriority }}"
    - post:
        url: "/rest/v1/tasks/{{ idTask }}/close"  
    - post:
        url: "/rest/v1/tasks/{{ idTask }}/reopen"   
    - delete:
        url: "/rest/v1/tasks/{{ idTask }}"